In [ ]:
import pandas as pd

In [4]:
df = pd.read_csv('data/titanic.csv', index_col=0)
df.head()

,Name,PClass,Age,Sex,Survived,SexCode
PassengerID,,,,,,
1,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
2,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
3,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
4,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
5,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [7]:
df.Age.mean()

np.float64(30.397989417989418)

In [ ]:
aggregated = df.groupby('Sex').agg({'Age': 'mean'})
aggregated.head()

              Age
Sex
female  29.396424
male    31.014338

In [14]:
survived = df[df.Survived == 1]
survived_aggregated = survived.groupby("Sex").agg({'Age': 'mean'})
survived_aggregated.head()

              Age
Sex
female  30.867143
male    25.951875

In [13]:
sorted_passangers = df.sort_values(by='Age')
sorted_passangers.iloc[1283]

Name        Thorneycroft, Mrs Percival
PClass                             3rd
Age                                NaN
Sex                             female
Survived                             1
SexCode                              1
Name: 1252, dtype: object